[Dutch]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Sluit de 2.4GHz USB-dongle van het apparaat aan op de USB-poort van uw computer om het te koppelen.
Please follow the steps below for pairing. = Volg de onderstaande stappen voor het koppelen.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Stel de verbindingsschakelaar in op de RF 2.4GHz-modus.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Houd de linkerknop, de rechterknop en de DPI-knop gedurende 3 seconden ingedrukt.
3. Click the "Pair" button on the interface. = 3. Klik op de knop “Koppelen“  op de interface.	
1. Connect the device to your computer with the USB cable. = 1. Sluit het apparaat aan op uw computer met de USB-kabel.
2. Click the "Pair" button on the interface. = 2. Klik op de knop “Koppelen“  op de interface.

Pair = Koppelen
Close = Sluiten
Pairing = Koppelen
Pairing completed = Koppelen voltooid
Pairing failed = Koppelen mislukt

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Sluit het apparaat aan op uw computer met een USB-kabel en zet de verbindingsschakelaar op de RF 2.4GHz-modus.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Houd de functieknop 15 seconden ingedrukt tot uw akoestische signalen hoort.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Koppel de RF 2.4 GHz-ontvanger los en sluit deze opnieuw aan. Schakel het apparaat uit en schakel het apparaat vervolgens naar de RF 2.4 GHz-modus.